app/controllers/admin/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE ("courses"."id" = 2) LIMIT 1
SELECT "time_format_groups".* FROM "time_format_groups" WHERE ("time_format_groups"."id" = 1) LIMIT 1
INSERT INTO "time_entries" ("course_id", "created_at", "end_date_time", "start_date_time", "updated_at") VALUES (2, '2010-10-12 05:45:48.359418', '2010-10-12 08:00:00.000000', '2010-10-12 08:00:00.000000', '2010-10-12 05:45:48.359418')
---
  def add_tee_time
    @course = Course.find(params[:id])
    @time_format_group = TimeFormatGroup.find(params[:time_format_group_id])
    logger.debug "Time format group: #{@time_format_group.inspect}"
    @day = Date.parse(params[:day])#.to_date
    logger.debug "Day: #{@day.inspect}"
    @start_date_time = start_from_group_and_date(@time_format_group, @day)
    logger.debug "Start Time: #{@start_date_time.inspect}"
    @end_date_time = start_from_group_and_date(@time_format_group, @day)
    logger.debug "End Time: #{@start_date_time.inspect}"

    @course.time_entries.create(:start_date_time => @start_date_time, :end_date_time => @end_date_time)

SELECT "courses".* FROM "courses" WHERE ("courses"."id" = 5) LIMIT 1
SELECT "time_display_formats".* FROM "time_display_formats" WHERE ("time_display_formats"."time_display_type_id" = 2) LIMIT 1
---
  def show
    @day = DateTime.now

    @course = Course.find(params[:id])
    @time_entries = @course.time_entries
    #ToDo: This should probably be pushed to the model (encapsulate 2 = 'weekly')
    @course_display = TimeDisplayFormat.find_by_time_display_type_id(2)

SELECT "courses".* FROM "courses" WHERE ("courses"."id" = 3) LIMIT 1
---
  def edit
    @course = Course.find(params[:id])

INSERT INTO "courses" ("created_at", "description", "location", "name", "updated_at") VALUES ('2010-10-15 01:40:55.947614', 'A mere 15 minutes from downtown Calgary, Valley Ridge Golf Club feels as though it''s worlds away from the hustle of city life', 'NW Calgary', 'Valley Ridge Golf', '2010-10-15 01:40:55.947614')
---
  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save

SELECT "courses".* FROM "courses" WHERE ("courses"."id" = 3) LIMIT 1
UPDATE "courses" SET "description" = 'The Elks is a beautiful oasis conveniently located just northwest of the junction of Deerfoot Trail and the Trans Canada Highway in the center of Calgary', "updated_at" = '2010-10-15 01:46:06.270606' WHERE ("courses"."id" = 3)
---
  def update
    @course = Course.find(params[:id])

    respond_to do |format|
      if @course.update_attributes(params[:course])