app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
---
  def save
    if has_owner_privileges?
      logger.debug "Made it to 'save'"
      logger.debug params.inspect
      @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE ("users"."user_role_id" = 3)
---
  def index
    if current_user.is_admin?
      @users = User.all
    else
      @users = User.find_all_by_user_role_id(3)

SELECT "users".* FROM "users" WHERE ("users"."id" = 2) LIMIT 1
SELECT "user_roles".* FROM "user_roles" WHERE ("user_roles"."id" = 2) LIMIT 1
---
  def show
    @user = User.find(params[:id])
    @user_role = UserRole.find(@user.user_role_id)