app/views/courses/index.html.erb

						<% # ToDo: something better than just grabbing the first time display format %>
		 				<% course.time_display_formats.first.time_format_groups.each do |format_group| %>
---
SELECT "time_format_groups".* FROM "time_format_groups" WHERE ("time_format_groups".time_display_format_id = 1)