app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" ORDER BY time_entries.updated_at desc
---
  def index
    @courses = Course.all