app/views/admin/courses/show.html.erb

SELECT "time_format_groups".* FROM "time_format_groups" WHERE ("time_format_groups".time_display_format_id = 1)
---
					<tr>
		 				<% @course_display.time_format_groups.each do |format_group| %>